{
    "justification": {
        "3R": "Content under the 3R category is monitored because it can incite public unrest, promote hate speech, or threaten national harmony. Malaysia's Sedition Act 1948 and Communications and Multimedia Act 1998 ban content that undermines the monarchy, promotes racial discrimination, or insults religious beliefs. Sections 298 and 298A of the Penal Code make it illegal to cause religious disharmony or stir up hatred between racial groups. Due to Malaysia's multicultural and multireligious society, regulators watch for content that could spread false stories or spark tensions that might damage social unity.",
        "ATIPSOM": "Content flagged under ATIPSOM relates to human trafficking, forced labor, and illegal migration. Malaysia's Anti-Trafficking in Persons and Smuggling of Migrants Act 2007 (Act 670) prohibits deceptive recruitment, coercion, and unauthorized migration. Sections 12 and 14 of the Act address forced labor and exploitation, while Section 26 criminalizes assistance in migrant smuggling. Due to Malaysia's commitments under the UN Palermo Protocol, any content that enables trafficking networks, deceives job seekers, or promotes illegal migration routes is treated as a serious legal and humanitarian concern.",
        "Sexual & Family": "The Sexual & Family category covers content that violates Malaysia's Penal Code, Sexual Offences Against Children Act 2017, and Domestic Violence Act 1994. This encompasses online sexual exploitation, harassment, domestic abuse, and non-consensual content. The Penal Code's Sections 292, 372, and 509 make obscene material, sexual misconduct, and harassment illegal. Child protection laws (Sexual Offences Against Children Act 2017, Sections 5, 11, and 15) ban grooming, child pornography, and exploitation. These regulatory measures prevent content that could normalize, glorify, or enable harmful behaviors—thereby protecting victims and maintaining digital safety.",
        "Scam": "Content related to scams is flagged for its fraudulent and deceptive nature, which violates the Financial Services Act 2013, Capital Markets and Services Act 2007, and the Penal Code (Section 420 on fraud). These scams typically promise unrealistic financial returns to lure users into unauthorized investments, Ponzi schemes, or phishing attacks. Any content associated with unregistered financial entities—as listed by Bank Negara Malaysia and the Securities Commission Malaysia—is deemed high-risk. RADAR helps protect the public by identifying investment frauds, financial scams, and misleading advertisements, thus preventing monetary losses, identity theft, and misinformation.",
        "3R,Scam": "Content categorized under 3R and Scam poses a dual risk of public unrest and financial deception. Topics involving monarchy, ethnicity, and religion can be manipulated to gain public trust, leaving individuals vulnerable to fraudulent schemes. These scams typically involve misleading financial promises, unauthorized investments, or Ponzi schemes, which violate Malaysia's Financial Services Act 2013 and Penal Code (Section 420 on fraud). Malaysia's legal framework closely monitors such content to prevent social exploitation, misinformation, and financial harm that could undermine public trust.",
        "3R,ATIPSOM": "Content categorized under 3R and ATIPSOM poses a serious risk of social division and human exploitation. Topics involving monarchy, ethnicity, and religion can be used to justify or promote trafficking networks, deceiving vulnerable individuals into forced labor or illegal migration. This content violates Malaysia's Anti-Trafficking in Persons and Smuggling of Migrants Act 2007 (Act 670) and Sections 298 and 298A of the Penal Code. Regulators actively monitor and address misleading narratives, coercion tactics, and deceptive recruitment linked to racial or religious contexts.",
        "3R,Sexual & Family": "Content categorized under 3R and Sexual & Family threatens social stability and risks moral exploitation. Discussions about monarchy, ethnicity, or religion may be used to justify sexual misconduct, harassment, or abuse, violating Malaysia's Penal Code (Sections 292, 372, and 509) and the Sexual Offences Against Children Act 2017. This content can normalize harmful behavior, resulting in discrimination, exploitation, or domestic harm. Malaysia's legal framework strictly regulates inflammatory, misleading, or exploitative content related to social and family values.",
        "Scam,3R": "Content categorized under 3R and Scam poses a dual risk of public unrest and financial deception. Topics involving monarchy, ethnicity, and religion can be manipulated to gain public trust, leaving individuals vulnerable to fraudulent schemes. These scams typically involve misleading financial promises, unauthorized investments, or Ponzi schemes, which violate Malaysia's Financial Services Act 2013 and Penal Code (Section 420 on fraud). Malaysia's legal framework closely monitors such content to prevent social exploitation, misinformation, and financial harm that could undermine public trust.",
        "Scam,ATIPSOM": "Content categorized under Scam and ATIPSOM presents significant risks of financial fraud and human exploitation. Criminals often use deceptive job offers, fake recruitment agencies, or investment schemes to trap victims in forced labor, human trafficking, or illegal migration. This content violates Malaysia's Anti-Trafficking in Persons and Smuggling of Migrants Act 2007 (Act 670) and Section 420 of the Penal Code on fraud. Authorities vigilantly monitor these activities to prevent exploitation, financial losses, and deceptive recruitment tactics targeting vulnerable individuals.",
        "Scam,Sexual & Family": " Content categorized under Scam and Sexual & Family presents serious risks of fraudulent exploitation and moral harm. Perpetrators often employ romance fraud, fake marriage proposals, or deceptive online relationships to financially manipulate victims or enable human trafficking. These actions violate Malaysia's Penal Code (Sections 372 and 509) and the Sexual Offences Against Children Act 2017, especially when targeting minors or vulnerable individuals. Authorities monitor such content to prevent financial abuse, coercion, and online exploitation disguised as legitimate relationships or services.",
        "ATIPSOM,Scam": "Content categorized under Scam and ATIPSOM presents significant risks of financial fraud and human exploitation. Criminals often use deceptive job offers, fake recruitment agencies, or investment schemes to trap victims in forced labor, human trafficking, or illegal migration. This content violates Malaysia's Anti-Trafficking in Persons and Smuggling of Migrants Act 2007 (Act 670) and Section 420 of the Penal Code on fraud. Authorities vigilantly monitor these activities to prevent exploitation, financial losses, and deceptive recruitment tactics targeting vulnerable individuals.",
        "ATIPSOM,3R": "Content categorized under 3R and ATIPSOM poses a serious risk of social division and human exploitation. Topics involving monarchy, ethnicity, and religion can be used to justify or promote trafficking networks, deceiving vulnerable individuals into forced labor or illegal migration. This content violates Malaysia's Anti-Trafficking in Persons and Smuggling of Migrants Act 2007 (Act 670) and Sections 298 and 298A of the Penal Code. Regulators actively monitor and address misleading narratives, coercion tactics, and deceptive recruitment linked to racial or religious contexts.",
        "ATIPSOM,Sexual & Family": "Content categorized under ATIPSOM and Sexual & Family presents severe risks of human exploitation, sexual abuse, and family-related crimes. Trafficking networks employ deceptive tactics, coercion, or illegal migration routes to enable forced labor and sexual exploitation, violating Malaysia's Anti-Trafficking in Persons and Smuggling of Migrants Act 2007 (Act 670) and the Sexual Offences Against Children Act 2017. Authorities monitor such content to prevent human rights violations, online grooming, and abuse of vulnerable individuals, ensuring compliance with national and international child protection laws.",
        "Sexual & Family,3R": "Content categorized under 3R and Sexual & Family threatens social stability and risks moral exploitation. Discussions about monarchy, ethnicity, or religion may be used to justify sexual misconduct, harassment, or abuse, violating Malaysia's Penal Code (Sections 292, 372, and 509) and the Sexual Offences Against Children Act 2017. This content can normalize harmful behavior, resulting in discrimination, exploitation, or domestic harm. Malaysia's legal framework strictly regulates inflammatory, misleading, or exploitative content related to social and family values.",
        "Sexual & Family,Scam": "Content categorized under Scam and Sexual & Family presents serious risks of fraudulent exploitation and moral harm. Perpetrators often employ romance fraud, fake marriage proposals, or deceptive online relationships to financially manipulate victims or enable human trafficking. These actions violate Malaysia's Penal Code (Sections 372 and 509) and the Sexual Offences Against Children Act 2017, especially when targeting minors or vulnerable individuals. Authorities monitor such content to prevent financial abuse, coercion, and online exploitation disguised as legitimate relationships or services.",
        "Sexual & Family,ATIPSOM": "Content categorized under ATIPSOM and Sexual & Family presents severe risks of human exploitation, sexual abuse, and family-related crimes. Trafficking networks employ deceptive tactics, coercion, or illegal migration routes to enable forced labor and sexual exploitation, violating Malaysia's Anti-Trafficking in Persons and Smuggling of Migrants Act 2007 (Act 670) and the Sexual Offences Against Children Act 2017. Authorities monitor such content to prevent human rights violations, online grooming, and abuse of vulnerable individuals, ensuring compliance with national and international child protection laws."
    },
    "totalReportedCases": "12.8k",
    "keywordTrends": [
        "lcmalaysia",
        "johor",
        "bukit",
        "tengok",
        "olympics",
        "melaka",
        "agama",
        "sedap",
        "dramatiktok",
        "ayam",
        "bahasa",
        "sekolah",
        "selangor",
        "rm",
        "raja",
        "sejarah",
        "trendingnewsmalaysia",
        "cina",
        "kelantan",
        "paris",
        "allah",
        "kerajaanperpaduan",
        "news",
        "wadahkini",
        "drama",
        "bangsa",
        "rempit",
        "dramamelayu",
        "trending",
        "melayu"
    ]
}